app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(strong_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ruby"], ["room_number", 101], ["created_at", "2020-12-19 01:34:11.889252"], ["updated_at", "2020-12-19 01:34:11.889252"]]

    def show
        @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def edit
        @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def update
        @school_class = SchoolClass.find_by(params[:id])
        @school_class.update(strong_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "rails"], ["updated_at", "2020-12-19 01:42:04.418101"], ["id", 1]]